### Handling the null value

The dataset can have the missing value due to 3 reason 

### 1 Missing Completely at Random, MCAR:
Missing completely at random (MCAR) is a type of missing data mechanism in which the probability of a value being missing is unrelated to both the observed data and the missing data. In other words, if the data is MCAR, the missing values are randomly distributed throughout the dataset, and there is no systematic reason for why they are missing.

For example, in a survey about the prevalence of a certain disease, the missing data might be MCAR if the survey participants with missing values for certain questions were selected randomly and their missing responses are not related to their disease status or any other variables measured in the survey.

### 2. Missing at Random MAR:
Missing at Random (MAR) is a type of missing data mechanism in which the probability of a value being missing depends only on the observed data, but not on the missing data itself. In other words, if the data is MAR, the missing values are systematically related to the observed data, but not to the missing data.
Here are a few examples of missing at random:

Income data: Suppose you are collecting income data from a group of people, but some participants choose not to report their income. If the decision to report or not report income is related to the participant's age or gender, but not to their income level, then the data is missing at random.

Medical data: Suppose you are collecting medical data on patients, including their blood pressure, but some patients do not report their blood pressure. If the patients who do not report their blood pressure are more likely to be younger or have healthier lifestyles, but the missingness is not related to their actual blood pressure values, then the data is missing at random.

## 3. Missing data not at random (MNAR) 
It is a type of missing data mechanism where the probability of missing values depends on the value of the missing data itself. In other words, if the data is MNAR, the missingness is not random and is dependent on unobserved or unmeasured factors that are associated with the missing values.

For example, suppose you are collecting data on the income and job satisfaction of employees in a company. If employees who are less satisfied with their jobs are more likely to refuse to report their income, then the data is not missing at random. In this case, the missingness is dependent on job satisfaction, which is not directly observed or measured.

**It can be done by three way**
we can replace the null value  through
1. **Mean**
2. **Median**
3. **Mode**

In [1]:
import seaborn as sns

In [2]:
df=sns.load_dataset('titanic')

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
## checking the null values
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
df.shape

(891, 15)

In [8]:
## if we simply remove all the rows which contain atleast one NAN value

df.dropna().shape
## dropna(): we can used two parameter  axis=0,1  -> 0-row, 1-col, and we want to reflect the changes in the main dataframe we can aslo write inplace=True
## we can see after dropping the  null values lots of rows will delete so it very difficult to perform any thing with that less data size

(182, 15)

In [10]:
## instead of delete it we can remove it with some values from that columns only
## Replacing it with the mean value of that col

df['Mean_age']=df['age'].fillna(df['age'].mean())
df[['Mean_age','age']]

      Mean_age   age
0    22.000000  22.0
1    38.000000  38.0
2    26.000000  26.0
3    35.000000  35.0
4    35.000000  35.0
..         ...   ...
886  27.000000  27.0
887  19.000000  19.0
888  29.699118   NaN
889  26.000000  26.0
890  32.000000  32.0

[891 rows x 2 columns]

In [11]:
## there is one limitation in this that if outlier present in the dataset then replaceing by the mean is not the right option

##median 
df['Median_age']=df['age'].fillna(df['age'].median())
df[['Mean_age','age','Median_age']]

      Mean_age   age  Median_age
0    22.000000  22.0        22.0
1    38.000000  38.0        38.0
2    26.000000  26.0        26.0
3    35.000000  35.0        35.0
4    35.000000  35.0        35.0
..         ...   ...         ...
886  27.000000  27.0        27.0
887  19.000000  19.0        19.0
888  29.699118   NaN        28.0
889  26.000000  26.0        26.0
890  32.000000  32.0        32.0

[891 rows x 3 columns]

In [14]:
## mode can be also when we have the caterioral data
df['embarked'].isnull().sum()

np.int64(2)

In [17]:
df['embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [31]:
df['embarked_mode']=df['embarked'].fillna(df['embarked'].mode()[0])
df[['embarked_mode','embarked']]

    embarked_mode embarked
0               S        S
1               C        C
2               S        S
3               S        S
4               S        S
..            ...      ...
886             S        S
887             S        S
888             S        S
889             C        C
890             Q        Q

[891 rows x 2 columns]

In [32]:
df['embarked_mode'].isnull().sum()

np.int64(0)